import Faq from "react-faq-component";
import faq from "../../assets/FAQ/FAQ.png"

const data = {
    rows: [
        {
            title: "আপনি কেন হোটেল ম্যানেজমেন্ট ইন্টারভিউ বেছে নেন?",
            content: `হোটেল ম্যানেজমেন্টে ক্যারিয়ার বেছে নিলেন কেন? উত্তর: “আমি হোটেল ম্যানেজমেন্ট বেছে নিয়েছিলাম কারণ আমার সেবার প্রতি আগ্রহ আছে । চমৎকার গ্রাহক সেবা প্রদান এবং অতিথিদের জন্য স্মরণীয় অভিজ্ঞতা তৈরি করার মাধ্যমে আমি সন্তুষ্টি উপভোগ করি।`,
        },
        {
            title: "কেন আপনি আমাদের হোটেল যোগদান করতে চান?",
            content:
                `হোটেলের ডিজাইন এবং আর্কিটেকচারে কোম্পানি যে সৃজনশীলতা এবং উদ্ভাবন নিয়ে আসে তার প্রতি আমি আকৃষ্ট হয়েছি ।

                তাছাড়া, আমি কোম্পানির সংস্কৃতি এবং দলগত গতিশীল সম্পর্কে দুর্দান্ত জিনিস শুনেছি এবং আমি এমন একটি ইতিবাচক এবং গতিশীল কাজের পরিবেশের অংশ হতে চাই।`,
        },
        {
            title: "হোটেলে কাজ কেন করতে হয়?",
            content: `হোটেল শিল্প একটি ফলপ্রসূ এবং উত্তেজনাপূর্ণ ক্ষেত্র যা বৃদ্ধি, সৃজনশীলতা, ভ্রমণ, উত্তেজনা এবং পরিপূর্ণতার জন্য অনেক সুযোগ প্রদান করে।
            
            আপনি যদি আতিথেয়তা এবং গ্রাহক পরিষেবা সম্পর্কে উত্সাহী হন এবং আপনি একটি দলে কাজ করতে পছন্দ করেন তবে হোটেল শিল্পে একটি ক্যারিয়ার আপনার জন্য উপযুক্ত হতে পারে। `,
        },
        {
            title: "কেন আমি আপনাকে নিয়োগ করব?",
            content: <p>উত্তর দেওয়ার সময়, আপনার প্রাসঙ্গিক দক্ষতা, অভিজ্ঞতা এবং কৃতিত্বের উপর ফোকাস করুন যা আপনাকে ভূমিকার জন্য সবচেয়ে উপযুক্ত করে তোলে৷ আপনার আমাকে নিয়োগ করা উচিত কারণ আমি একজন কঠোর কর্মী যিনি আপনার কোম্পানিকে সফল হতে সাহায্য করতে চান ৷ আমার কাছে কাজের জন্য প্রয়োজনীয় দক্ষতা এবং অভিজ্ঞতা আছে এবং আমি আপনার দলের সাথে শিখতে এবং বড় হতে আগ্রহী।</p>,
        },
    ],
};


const styles = {
    bgColor: 'white',
    // titleTextColor: "blue",
    // rowTitleColor: "blue",
    rowContentColor: 'grey',
    // arrowColor: "red",
};

const config = {
    animate: true,
    arrowIcon: "+",
    tabFocus: true
};


const FAQ = () => {
    return (
        <div className="flex justify-between items-center flex-col lg:flex-row">
            <div>
                <img src={faq} />
            </div>
            <div className="mb-24">
                <h1 className="text-center text-4xl my-5 font-bold">কিছু কমন প্রশ্ন</h1>
                <Faq
                    data={data}
                    styles={styles}
                    config={config}
                />
            </div>
        </div>
    );
};

export default FAQ;